<script>
    import "./style.scss";

    export let data;
</script>

<div class="state-info">
    <div class="state-info__title">Технический тюнинг:</div>
    <div class="state-info__cards">
        <div class="card">
            <div class="card__title">Двигатель</div>
            <div class="card__value">
                <div class="vehicle-icon">
                    <svg xmlns="http://www.w3.org/2000/svg" width="1.3888888888888888vh" height="0.901574074074074vh" viewBox="0 0 15 9.737" > <g id="engine" transform="translate(0 -2.632)"> <g id="Сгруппировать_3518" data-name="Сгруппировать 3518" > <g id="Сгруппировать_3517" data-name="Сгруппировать 3517" > <path id="Контур_12587" data-name="Контур 12587" d="M10.285,5.006l-.824-.731H8.1V3.61h.438V2.632H5.061V3.61H5.5v.665H4.08l-.824.731h-1.3v2.43H.978V6.187H0V9.662H.978V8.414h.978v2.43H4.08L5.8,12.368h5.784V5.006Z" fill="#3d82d5" ></path> </g> </g> <g id="Сгруппировать_3520" data-name="Сгруппировать 3520" > <g id="Сгруппировать_3519" data-name="Сгруппировать 3519" > <path id="Контур_12588" data-name="Контур 12588" d="M14.482,5.766l-.142-.238H12.562v6.288H14.34l.142-.238A5.989,5.989,0,0,0,15,8.671,5.989,5.989,0,0,0,14.482,5.766Z" fill="#3d82d5" ></path> </g> </g> </g> </svg>
                </div>
                { data.params.tuning.engine } ур.
            </div>
        </div>
        <div class="card">
            <div class="card__title">Тормоза</div>
            <div class="card__value">
                <div class="vehicle-icon">
                    <svg xmlns="http://www.w3.org/2000/svg" width="1.3289814814814813vh" height="1.3888888888888888vh" viewBox="0 0 14.353 15" > <g id="_02-brake" data-name="02-brake" transform="translate(-0.022)" > <g id="Glyph"> <path id="Контур_12600" data-name="Контур 12600" d="M8.789,1.372V3.126a1.25,1.25,0,0,1-1.247,1.25H7.486A3.759,3.759,0,0,0,4.074,6.6a1.25,1.25,0,0,1-1.649.633L.814,6.522a6.875,6.875,0,1,0,7.975-5.15ZM7.5,10.625a2.5,2.5,0,1,1,2.5-2.5A2.5,2.5,0,0,1,7.5,10.625Z" fill="#3d82d5" ></path> <circle id="Эллипс_701" data-name="Эллипс 701" cx="0.625" cy="0.625" r="0.625" transform="translate(5.625 7.5)" fill="#3d82d5" ></circle> <circle id="Эллипс_702" data-name="Эллипс 702" cx="0.625" cy="0.625" r="0.625" transform="translate(8.125 7.5)" fill="#3d82d5" ></circle> <circle id="Эллипс_703" data-name="Эллипс 703" cx="0.625" cy="0.625" r="0.625" transform="translate(6.875 6.25)" fill="#3d82d5" ></circle> <circle id="Эллипс_704" data-name="Эллипс 704" cx="0.625" cy="0.625" r="0.625" transform="translate(6.875 8.75)" fill="#3d82d5" ></circle> <path id="Контур_12601" data-name="Контур 12601" d="M2.932,6.72A.625.625,0,0,0,3.5,6.35a4.385,4.385,0,0,1,4-2.6h.034a.625.625,0,0,0,.63-.625V.625A.625.625,0,0,0,7.543,0H7.5A8.142,8.142,0,0,0,.076,4.825a.625.625,0,0,0,.317.826L2.679,6.666a.623.623,0,0,0,.254.054Z" fill="#3d82d5" ></path> </g> </g> </svg>
                </div>
                { data.params.tuning.brakes } ур.
            </div>
        </div>
        <div class="card">
            <div class="card__title">Трансмиссия</div>
            <div class="card__value">
                <div class="vehicle-icon">
                    <svg xmlns="http://www.w3.org/2000/svg" width="1.3888888888888888vh" height="1.3888888888888888vh" viewBox="0 0 15 15" > <path id="manual-transmission" d="M15,1.75a1.75,1.75,0,1,0-2.5,1.581V5.75a1,1,0,0,1-1,1H9.081a1.757,1.757,0,0,0-.831-.831V3.331a1.75,1.75,0,1,0-1.5,0V5.919a1.757,1.757,0,0,0-.831.831H2.5V3.331a1.75,1.75,0,1,0-1.5,0v8.337a1.75,1.75,0,1,0,1.5,0V8.25H5.919a1.757,1.757,0,0,0,.831.831v2.587a1.75,1.75,0,1,0,1.5,0V9.081a1.757,1.757,0,0,0,.831-.831H11.5A2.5,2.5,0,0,0,14,5.75V3.331A1.75,1.75,0,0,0,15,1.75Z" transform="translate(0 0)" fill="#3d82d5" ></path> </svg>
                </div>
                { data.params.tuning.transmission } ур.
            </div>
        </div>
        <div class="card">
            <div class="card__title">Турбонадув</div>
            <div class="card__value">
                <div class="vehicle-icon">
                    <svg id="turbo" xmlns="http://www.w3.org/2000/svg" width="1.3888888888888888vh" height="1.3021296296296296vh" viewBox="0 0 15 14.063" > <path id="Контур_12612" data-name="Контур 12612" d="M14.092.879h-7.5a6.594,6.594,0,1,0,6.214,4.395H8.738a3.071,3.071,0,1,1-2.146-.879h7.5v.879H15V0h-.908Zm0,0" fill="#3d82d5" ></path> <path id="Контур_12613" data-name="Контур 12613" d="M8.753,7.83a2.057,2.057,0,0,0-.141-1.222l-.431.026a1.284,1.284,0,0,0-.479.13,1.311,1.311,0,0,1,.163.379A2.147,2.147,0,0,1,8.753,7.83Zm0,0" fill="#3d82d5" ></path> <path id="Контур_12614" data-name="Контур 12614" d="M4.431,7.111a2.057,2.057,0,0,0,.141,1.222L5,8.307a1.284,1.284,0,0,0,.479-.13A1.311,1.311,0,0,1,5.32,7.8,2.147,2.147,0,0,1,4.431,7.111Zm0,0" fill="#3d82d5" ></path> <path id="Контур_12615" data-name="Контур 12615" d="M6.85,5.3l-.189.377a1.279,1.279,0,0,0-.127.482c.019,0,.037-.006.057-.006a1.3,1.3,0,0,1,.352.054A2.147,2.147,0,0,1,7.978,5.78,2.173,2.173,0,0,0,6.85,5.3Zm0,0" fill="#3d82d5" ></path> <path id="Контур_12616" data-name="Контур 12616" d="M5.672,6.529a2.15,2.15,0,0,1,.15-1.109,2.2,2.2,0,0,0-.983.74l.234.354a1.283,1.283,0,0,0,.355.351A1.321,1.321,0,0,1,5.672,6.529Zm0,0" fill="#3d82d5" ></path> <path id="Контур_12617" data-name="Контур 12617" d="M8.344,8.782l-.234-.354a1.282,1.282,0,0,0-.355-.351,1.321,1.321,0,0,1-.244.336,2.15,2.15,0,0,1-.15,1.109A2.2,2.2,0,0,0,8.344,8.782Zm0,0" fill="#3d82d5" ></path> <path id="Контур_12618" data-name="Контур 12618" d="M7.031,7.471a.439.439,0,1,0-.439.439A.44.44,0,0,0,7.031,7.471Zm0,0" fill="#3d82d5" ></path> <path id="Контур_12619" data-name="Контур 12619" d="M6.522,9.265a1.279,1.279,0,0,0,.127-.482c-.019,0-.037.006-.057.006a1.3,1.3,0,0,1-.352-.054,2.147,2.147,0,0,1-1.034.426,2.174,2.174,0,0,0,1.128.481Zm0,0" fill="#3d82d5" ></path> <path id="Контур_12620" data-name="Контур 12620" d="M13.184,12.744a1.309,1.309,0,0,0-.471-1,7.521,7.521,0,0,1-1.85,1.85,1.313,1.313,0,0,0,2.321-.847Zm0,0" fill="#3d82d5" ></path> <path id="Контур_12621" data-name="Контур 12621" d="M2.321,1.35A1.313,1.313,0,1,0,.471,3.2,7.521,7.521,0,0,1,2.321,1.35Zm0,0" fill="#3d82d5" ></path> <path id="Контур_12622" data-name="Контур 12622" d="M.471,11.742a1.313,1.313,0,1,0,1.85,1.85A7.521,7.521,0,0,1,.471,11.742Zm0,0" fill="#3d82d5" ></path> </svg>
                </div>
                { data.params.tuning.turbo } ур.
            </div>
        </div>
    </div>
</div>
